In [4]:
import pandas as pd
import re

In [5]:
data_df = pd.read_csv('Dataset.csv')

In [9]:
data_df.drop (columns=data_df. columns [0], axis= 1, inplace= True)

(9213, 5)

In [10]:
data_df.head()

   lt_no    yr title                                                 lt  class
0  14770  1996   NaN   Washington, D C   14770January 3, 1996ACCOUNT...      0
1  14771  1996   NaN  v  WILLIAM J  YOUNG, UnitedStates District Cou...      1
2  14772  1996   NaN    14772January 3, 1995SEC v  Basic Energy & Af...      1
3  14773  1996   NaN    14773January 3, 1996SEC v  Edmund J  Lopinsk...      0
4  14774  1996   NaN   Washington, D C   14774January 4, 1996V  ROBE...      0

In [11]:
count =0
count2 =0
both = 0
anyone =0
data_df['class'] = 0

In [12]:
for index, row in data_df.iterrows():
    title_flag= False
    litigation_flag = False
    title = str(row['title'])
    litigation = str(row['lt'])
    if 'insider' in title.lower():
        count +=1
        anyone +=1
        title_flag = True
        data_df.loc[index,'class'] = 1
        
    if 'insider' in litigation.lower():
        count2 +=1
        anyone +=1
        litigation_flag = True
        data_df.loc[index,'class'] = 1
        
    if title_flag and litigation_flag:
        both+=1

In [13]:
data_infected_df = data_df[data_df['class'] ==1]
data_non_infected_df = data_df[data_df['class'] ==0]

In [15]:
data_infected_df.to_csv("infected.csv", sep=',')
data_non_infected_df.to_csv("non_infected.csv", sep=',')

In [24]:
data_infected_df.shape

(1373, 5)

In [17]:
data_non_infected_df.shape

(7840, 5)

In [23]:
data_df.head()

   lt_no    yr title                                                 lt  class
0  14770  1996   NaN   Washington, D C   14770January 3, 1996ACCOUNT...      0
1  14771  1996   NaN  v  WILLIAM J  YOUNG, UnitedStates District Cou...      0
2  14772  1996   NaN    14772January 3, 1995SEC v  Basic Energy & Af...      0
3  14773  1996   NaN    14773January 3, 1996SEC v  Edmund J  Lopinsk...      0
4  14774  1996   NaN   Washington, D C   14774January 4, 1996V  ROBE...      0